nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/RenesasRX72NwithToppers/asp/driver/rx_gcc/EPTPC_reg.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 *
 *  Copyright (C) 2017- by Hisashi Hata, JAPAN
 *
 * The above copyright holders grant permission gratis to use,
 * duplicate, modify, or redistribute (hereafter called use) this
 * software (including the one made by modifying this software),
 * provided that the following four conditions (1) through (4) are
 * satisfied.
 *
 * (1) When this software is used in the form of source code, the above
 *     copyright notice, this use conditions, and the disclaimer shown
 *     below must be retained in the source code without modification.
 *
 * (2) When this software is redistributed in the forms usable for the
 *     development of other software, such as in library form, the above
 *     copyright notice, this use conditions, and the disclaimer shown
 *     below must be shown without modification in the document provided
 *     with the redistributed software, such as the user manual.
 *
 * (3) When this software is redistributed in the forms unusable for the
 *     development of other software, such as the case when the software
 *     is embedded in a piece of equipment, either of the following two
 *     conditions must be satisfied:
 *
 *   (a) The above copyright notice, this use conditions, and the
 *       disclaimer shown below must be shown without modification in
 *       the document provided with the redistributed software, such as
 *     the user manual.
 *
 *   (b) How the software is to be redistributed must be reported to the
 *       TOPPERS Project according to the procedure described
 *       separately.
 *
 * (4) The above copyright holders and the TOPPERS Project are exempt
 *     from responsibility for any type of damage directly or indirectly
 *     caused from the use of this software and are indemnified by any
 *     users or end users of this software from any and all causes of
 *     action whatsoever.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS." THE ABOVE COPYRIGHT HOLDERS AND
 * THE TOPPERS PROJECT DISCLAIM ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, ITS APPLICABILITY TO A PARTICULAR
 * PURPOSE. IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS AND THE
 * TOPPERS PROJECT BE LIABLE FOR ANY TYPE OF DAMAGE DIRECTLY OR
 * INDIRECTLY CAUSED FROM THE USE OF THIS SOFTWARE.
 */


#ifndef RX_GCC_DRIVER_EPTPC_REG_H
#define RX_GCC_DRIVER_EPTPC_REG_H

#define EPTPC_BASEADDR 0x000C4000
#define EPTPC_MIESR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x0))
#define EPTPC_MIESR_CYC5 ((uint32_t)(0x1 << 21))
#define EPTPC_MIESR_CYC4 ((uint32_t)(0x1 << 20))
#define EPTPC_MIESR_CYC3 ((uint32_t)(0x1 << 19))
#define EPTPC_MIESR_CYC2 ((uint32_t)(0x1 << 18))
#define EPTPC_MIESR_CYC1 ((uint32_t)(0x1 << 17))
#define EPTPC_MIESR_CYC0 ((uint32_t)(0x1 << 16))
#define EPTPC_MIESR_PRC ((uint32_t)(0x1 << 3))
#define EPTPC_MIESR_SY1 ((uint32_t)(0x1 << 2))
#define EPTPC_MIESR_SY0 ((uint32_t)(0x1 << 1))
#define EPTPC_MIESR_ST ((uint32_t)0x1)
#define EPTPC_MIEIPR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x4))
#define EPTPC_MIEIPR_CYC5 ((uint32_t)(0x1 << 21))
#define EPTPC_MIEIPR_CYC4 ((uint32_t)(0x1 << 20))
#define EPTPC_MIEIPR_CYC3 ((uint32_t)(0x1 << 19))
#define EPTPC_MIEIPR_CYC2 ((uint32_t)(0x1 << 18))
#define EPTPC_MIEIPR_CYC1 ((uint32_t)(0x1 << 17))
#define EPTPC_MIEIPR_CYC0 ((uint32_t)(0x1 << 16))
#define EPTPC_MIEIPR_PR ((uint32_t)(0x1 << 3))
#define EPTPC_MIEIPR_SY1 ((uint32_t)(0x1 << 2))
#define EPTPC_MIEIPR_SY0 ((uint32_t)(0x1 << 1))
#define EPTPC_MIEIPR_ST ((uint32_t)0x1)
#define EPTPC_ELIPPR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x10))
#define EPTPC_ELIPPR_PLSN ((uint32_t)(0x1 << 24))
#define EPTPC_ELIPPR_PLSP ((uint32_t)(0x1 << 16))
#define EPTPC_ELIPPR_CYCN5 ((uint32_t)(0x1 << 13))
#define EPTPC_ELIPPR_CYCN4 ((uint32_t)(0x1 << 12))
#define EPTPC_ELIPPR_CYCN3 ((uint32_t)(0x1 << 11))
#define EPTPC_ELIPPR_CYCN2 ((uint32_t)(0x1 << 10))
#define EPTPC_ELIPPR_CYCN1 ((uint32_t)(0x1 << 9))
#define EPTPC_ELIPPR_CYCN0 ((uint32_t)(0x1 << 8))
#define EPTPC_ELIPPR_CYCP5 ((uint32_t)(0x1 << 5))
#define EPTPC_ELIPPR_CYCP4 ((uint32_t)(0x1 << 4))
#define EPTPC_ELIPPR_CYCP3 ((uint32_t)(0x1 << 3))
#define EPTPC_ELIPPR_CYCP2 ((uint32_t)(0x1 << 2))
#define EPTPC_ELIPPR_CYCP1 ((uint32_t)(0x1 << 1))
#define EPTPC_ELIPPR_CYCP0 ((uint32_t)0x1)
#define EPTPC_ELIPACR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x14))
#define EPTPC_ELIPACR_PLSN ((uint32_t)(0x1 << 24))
#define EPTPC_ELIPACR_PLSP ((uint32_t)(0x1 << 16))
#define EPTPC_ELIPACR_CYCN5 ((uint32_t)(0x1 << 13))
#define EPTPC_ELIPACR_CYCN4 ((uint32_t)(0x1 << 12))
#define EPTPC_ELIPACR_CYCN3 ((uint32_t)(0x1 << 11))
#define EPTPC_ELIPACR_CYCN2 ((uint32_t)(0x1 << 10))
#define EPTPC_ELIPACR_CYCN1 ((uint32_t)(0x1 << 9))
#define EPTPC_ELIPACR_CYCN0 ((uint32_t)(0x1 << 8))
#define EPTPC_ELIPACR_CYCP5 ((uint32_t)(0x1 << 5))
#define EPTPC_ELIPACR_CYCP4 ((uint32_t)(0x1 << 4))
#define EPTPC_ELIPACR_CYCP3 ((uint32_t)(0x1 << 3))
#define EPTPC_ELIPACR_CYCP2 ((uint32_t)(0x1 << 2))
#define EPTPC_ELIPACR_CYCP1 ((uint32_t)(0x1 << 1))
#define EPTPC_ELIPACR_CYCP0 ((uint32_t)0x1)
#define EPTPC_STSR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x40))
#define EPTPC_STSR_W10D ((uint32_t)(0x1 << 4))
#define EPTPC_STSR_SYNTOUT ((uint32_t)(0x1 << 3))
#define EPTPC_STSR_SYNCOUT ((uint32_t)(0x1 << 1))
#define EPTPC_STSR_SYNC ((uint32_t)0x1)
#define EPTPC_STIPR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x44))
#define EPTPC_STIPR_W10D ((uint32_t)(0x1 << 4))
#define EPTPC_STIPR_SYNTOUT ((uint32_t)(0x1 << 3))
#define EPTPC_STIPR_SYNCOUT ((uint32_t)(0x1 << 1))
#define EPTPC_STIPR_SYNC ((uint32_t)0x1)
#define EPTPC_STCFR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x50))
#define EPTPC_STCFR_STCF_20M ((uint32_t)0x0)
#define EPTPC_STCFR_STCF_25M ((uint32_t)0x1)
#define EPTPC_STCFR_STCF_50M ((uint32_t)0x2)
#define EPTPC_STCFR_STCF_100M ((uint32_t)0x3)
#define EPTPC_STMR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x54))
#define EPTPC_STMR_ALEN1 ((uint32_t)(0x1 << 29))
#define EPTPC_STMR_ALEN0 ((uint32_t)(0x1 << 28))
#define EPTPC_STMR_DVTH ((uint32_t)(0x1 << 20))
#define EPTPC_STMR_SYTH ((uint32_t)(0x1 << 16))
#define EPTPC_STMR_W10S ((uint32_t)(0x1 << 15))
#define EPTPC_STMR_CMOD ((uint32_t)(0x1 << 13))
#define EPTPC_STMR_WINT_MASK ((uint32_t)0xff)
#define EPTPC_SYNTOR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x58))
#define EPTPC_IPTSELR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x60))
#define EPTPC_IPTSELR_IPTSEL5 ((uint32_t)(0x1 << 5))
#define EPTPC_IPTSELR_IPTSEL4 ((uint32_t)(0x1 << 4))
#define EPTPC_IPTSELR_IPTSEL3 ((uint32_t)(0x1 << 3))
#define EPTPC_IPTSELR_IPTSEL2 ((uint32_t)(0x1 << 2))
#define EPTPC_IPTSELR_IPTSEL1 ((uint32_t)(0x1 << 1))
#define EPTPC_IPTSELR_IPTSEL0 ((uint32_t)0x1)
#define EPTPC_MITSELR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x64))
#define EPTPC_MITSELR_MINTEN5 ((uint32_t)(0x1 << 5))
#define EPTPC_MITSELR_MINTE4 ((uint32_t)(0x1 << 4))
#define EPTPC_MITSELR_MINTE3 ((uint32_t)(0x1 << 3))
#define EPTPC_MITSELR_MINTE2 ((uint32_t)(0x1 << 2))
#define EPTPC_MITSELR_MINTE1 ((uint32_t)(0x1 << 1))
#define EPTPC_MITSELR_MNTE0 ((uint32_t)0x1)
#define EPTPC_ELTSELR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x68))
#define EPTPC_ELTSELR_ELTDIS5 ((uint32_t)(0x1 << 5))
#define EPTPC_ELTSELR_ELTDIS4 ((uint32_t)(0x1 << 4))
#define EPTPC_ELTSELR_ELTDIS3 ((uint32_t)(0x1 << 3))
#define EPTPC_ELTSELR_ELTDIS2 ((uint32_t)(0x1 << 2))
#define EPTPC_ELTSELR_ELTDIS1 ((uint32_t)(0x1 << 1))
#define EPTPC_ELTSELR_ELTDIS0 ((uint32_t)0x1)
#define EPTPC_STCHSELR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x6c))
#define EPTPC_STCHSELR_SYSEL ((uint32_t)0x1)
#define EPTPC_SYNSTARTR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x80))
#define EPTPC_SYNSTARTR_STR ((uint32_t)0x1)
#define EPTPC_LCIVLDR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x84))
#define EPTPC_LCIVLDR_LOAD ((uint32_t)0x1)
#define EPTPC_SYNTDARU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x90))
#define EPTPC_SYNTDARL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x94))
#define EPTPC_SYNTDBRU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x98))
#define EPTPC_SYNTDBRL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x9c))
#define EPTPC_LCIVRU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0xb0))
#define EPTPC_LCIVRM_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0xb4))
#define EPTPC_LCIVRL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0xb8))
#define EPTPC_GETW10R_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x124))
#define EPTPC_GETW10R_GW10 ((uint32_t)0x1)
#define EPTPC_PLIMITRU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x128))
#define EPTPC_PLIMITRM_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x12c))
#define EPTPC_PLIMTRL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x130))
#define EPTPC_MLIMITRU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x134))
#define EPTPC_MLIMITRM_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x138))
#define EPTPC_MLIMITRL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x13c))
#define EPTPC_GETINFOR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x140))
#define EPTPC_GETINFOR_INFO ((uint32_t)0x1)
#define EPTPC_LCCVRU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x170))
#define EPTPC_LCCVRM_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x174))
#define EPTPC_LCCVRL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x178))
#define EPTPC_PW10VRU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x210))
#define EPTPC_PW10VRM_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x214))
#define EPTPC_PW10VRL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x218))
#define EPTPC_MW10RU_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x2d0))
#define EPTPC_MW10RM_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x2d4))
#define EPTPC_MW10RL_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x2d8))
#define EPTPC_TMSTTRU0_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x300))
#define EPTPC_TMSTTRL0_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x304))
#define EPTPC_TMSTTRU1_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x310))
#define EPTPC_TMSTTRL1_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x314))
#define EPTPC_TMSTTRU2_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x320))
#define EPTPC_TMSTTRL2_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x324))
#define EPTPC_TMSTTRU3_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x330))
#define EPTPC_TMSTTRL3_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x334))
#define EPTPC_TMSTTRU4_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x340))
#define EPTPC_TMSTTRL4_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x344))
#define EPTPC_TMSTTRU5_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x50))
#define EPTPC_TMSTTRL5_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x54))
#define EPTPC_TMCYCR0_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x308))
#define EPTPC_TMCYCR1_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x318))
#define EPTPC_TMCYCR2_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x328))
#define EPTPC_TMCYCR3_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x338))
#define EPTPC_TMCYCR4_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x348))
#define EPTPC_TMCYCR5_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x358))
#define EPTPC_TMPLSR0_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x30c))
#define EPTPC_TMPLSR1_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x31c))
#define EPTPC_TMPLSR2_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x32c))
#define EPTPC_TMPLSR3_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x33c))
#define EPTPC_TMPLSR4_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x34c))
#define EPTPC_TMPLSR5_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x35c))
#define EPTPC_TMSTARTR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x37c))
#define EPTPC_TMSTARTR_EN5 ((uint32_t)(0x1 << 5))
#define EPTPC_TMSTARTR_EN4 ((uint32_t)(0x1 << 4))
#define EPTPC_TMSTARTR_EN3 ((uint32_t)(0x1 << 3))
#define EPTPC_TMSTARTR_EN2 ((uint32_t)(0x1 << 2))
#define EPTPC_TMSTARTR_EN1 ((uint32_t)(0x1 << 1))
#define EPTPC_TMSTARTR_EN0 ((uint32_t)0x1)
#define EPTPC_PRSR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x400))
#define EPTPC_PRSR_URE1 ((uint32_t)(0x1 << 29))
#define EPTPC_PRSR_URE0 ((uint32_t)(0x1 << 28))
#define EPTPC_PRSR_MACE ((uint32_t)(0x1 << 8))
#define EPTPC_PRSR_OVRE3 ((uint32_t)(0x1 << 3))
#define EPTPC_PRSR_OVRE2 ((uint32_t)(0x1 << 2))
#define EPTPC_PRSR_OVRE1 ((uint32_t)(0x1 << 1))
#define EPTPC_PRSR_OVRE0 ((uint32_t)0x1)
#define EPTPC_PRIPR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x404))
#define EPTPC_PRIPR_URE1 ((uint32_t)(0x1 << 29))
#define EPTPC_PRIPR_URE0 ((uint32_t)(0x1 << 28))
#define EPTPC_PRIPR_MACE ((uint32_t)(0x1 << 8))
#define EPTPC_PRIPR_OVRE3 ((uint32_t)(0x1 << 3))
#define EPTPC_PRIPR_OVRE2 ((uint32_t)(0x1 << 2))
#define EPTPC_PRIPR_OVRE1 ((uint32_t)(0x1 << 1))
#define EPTPC_PRIPR_OVRE0 ((uint32_t)0x1)
#define EPTPC_PRMACRU0_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x410))
#define EPTPC_PRMACRL0_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x414))
#define EPTPC_PRMACRU1_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x418))
#define EPTPC_PRMACRL1_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x41c))
#define EPTPC_TRNDISR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x420))
#define EPTPC_TRNDISR_TDIS_BOTH ((uint32_t)0x1)
#define EPTPC_TRNDISR_TDIS_ETH0 ((uint32_t)0x1)
#define EPTPC_TRNDISR_TDIS_ETH1 ((uint32_t)0x2)
#define EPTPC_TRNMR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x430))
#define EPTPC_TRNMR_FWD1 ((uint32_t)(0x1 << 9))
#define EPTPC_TRNMR_FWD0 ((uint32_t)(0x1 << 8))
#define EPTPC_TRNMR_MOD ((uint32_t)0x1)
#define EPTPC_TRNCTTDR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0x434))
#define EPTPC_TRNCTTDR_THVAL_MASK ((uint32_t)0x7ff)
#define EPTPC_PTRSTR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0xc0500))
#define EPTPC_PTRSTR_RESET ((uint32_t)0x1)
#define EPTPC_STCSELR_ADDR ((volatile uint32_t*)(EPTPC_BASEADDR + 0xc0504))
#define EPTPC_STCSELR_SCLKSEL_PCLKA_DIV_1_6 ((uint32_t)(0x0 << 8))
#define EPTPC_STCSELR_SCLKSEL_REF50CK0 ((uint32_t)(0x2 << 8))
#define EPTPC_STCSELR_SCLKSEL_REF50CK1 ((uint32_t)(0x3 << 8))
#define EPTPC_STCSELR_SCLKDIV_DIV1 ((uint32_t)0x1)
#define EPTPC_STCSELR_SCLKDIV_DIV2 ((uint32_t)0x2)
#define EPTPC_STCSELR_SCLKDIV_DIV3 ((uint32_t)0x3)
#define EPTPC_STCSELR_SCLKDIV_DIV4 ((uint32_t)0x4)
#define EPTPC_STCSELR_SCLKDIV_DIV5 ((uint32_t)0x5)
#define EPTPC_STCSELR_SCLKDIV_DIV6 ((uint32_t)0x6)

#define EPTPC_PORT0_BASEADDR 0x000C4800
#define EPTPC_PORT1_BASEADDR 0x000C4C00

